local fdb = {}

-- init arrays with team, leagues and players data
fdb.leagues = {
  epl = {
    sob = {
      "АПЛ",
      "Об АПЛ",
      "Английская Премьер-лига",
      "Английской Премьер-лиги",
      "Английской Премьер-лиге",
      "Английскую Премьер-лигу",
      "Английской Премьер-лигой",
      "Об английской Премьер-лиге",
      "Чемпионат Англии",
      "Чемпионата Англии",
      "Чемпионату Англии",
      "Чемпионат Англии",
      "Чемпионатом Англии",
      "О чемпионате Англии"
    },
    gscl = 4,
    gcel = 1
    },
  seriaa = {
    sob = {
      "Серия А",
      "Серии А",
      "Серии А",
      "Серию А",
      "Серией А",
      "О Серии А",
      "Чемпионат Италии",
      "Чемпионата Италии",
      "Чемпионату Италии",
      "Чемпионат Италии",
      "Чемпионатом Италии",
      "О чемпионате Италии"
    },
    gscl = 4,
    gcel = 1,
    qcel = 1
    },
  rpl = {
    sob = {
      "РПЛ",
      "Российская Премьер-лига",
      "Российской Премьер-лиги",
      "Российской Премьер-лиге",
      "Российскую Премьер-лигу",
      "Российской Премьер-лигой",
      "О российской Премьер-лиге",
      "Чемпионат России",
      "Чемпионата России",
      "Чемпионату России",
      "Чемпионат России",
      "Чемпионатом России",
      "О чемпионате России"
    },
    gscl = 2,
    qccl = 1,
    gsel = 1,
    qcel = 1
    },
    el = {
      prefix = "УЕФА",
      "ЛЕ",
      "Об ЛЕ",
      "Лига Европы",
      "Лиги Европы",
      "Лиге Европы",
      "Лигу Европы",
      "Лигой Европы",
      "О Лиге Европы"
  }
}


fdb.coaches = {
  klopp = {
    sob = {
      "Юрген",
      "Юргена",
      "Юргену",
      "Юргена",
      "Юргеном",
      "О Юргене",
      "Клопп",
      "Клоппа",
      "Клоппу",
      "Клоппа",
      "Клоппом",
      "О Клоппе",
      "Немец"
    },
    age = 54
    }
  }

teams = {
  leagues = {
    epl = {
      lfc = {
        sob = {
          "Ливерпуль",
          "Ливерпуля",
          "Ливерпулю",
          "Ливерпуль",
          "Ливерпулем",
          "О Ливерпуле",
          "Красные",
          "Мерсисайдцы",
          "Скаузеры"
        },
        ec = "Лига чемпионов"
      }
    }
  }
}

fdb.players = {
  leagues = {
    teams = {
      lfc = {
        gk = {
          alisson = {
            name = {
              names = {
                "Алиссон",
                "Алиссона",
                "Алиссону",
                "Алиссона",
                "Алиссоном",
                "Об Алиссоне"
              },
              surname = {
                "Беккер",
                "Беккера",
                "Беккеру",
                "Беккера",
                "Беккером",
                "О Беккере"
                }
              },
              citizenship = "Brazi",
              value = 80000000,
              wage = 105000,
              age = 27,
              height = 191,
              gkpos = 90,
              gkdiving = 85,
              handing = 84,
              kicking = 85,
              reflexes = 89,
              reaction = 88,
              crossing = 17,
              shortpass = 45,
              longpass = 44,
              jumping = 52,
              penalties = 23
            },
            adrian = {
              }
            }
          }
      }
    }
  }

return fdb